In [1]:
%load_ext sql

In [2]:
%sql mysql+mysqlconnector://root:root@localhost

In [3]:
%%sql
use swiggy_da;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

## Business Analysis & Insights

This notebook focuses on extracting business insights from the validated
Swiggy-like food delivery dataset using SQL.

The objective is to answer real-world business questions related to:
- Revenue performance
- Customer behavior
- Restaurant performance
- Location-based demand
- Operational efficiency

All queries are written to reflect how a data analyst would support
decision-making in a production environment.

In [14]:
%%sql
#How many total orders were successfully delivered on the platform?
select count(*) as Total_delviered from orders 
where orders.order_status = 'DELIVERED';

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[(4065,)]

In [21]:
%%sql
#What is the total revenue generated from delivered orders?
select sum(total_amount) as total_revenue from orders
where orders.order_status = 'DELIVERED';

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[(Decimal('4235415'),)]

In [29]:
%%sql
#How many unique users have placed at least one order?
select count(distinct user_id) as Unique_users from orders
where order_status = 'DELIVERED';

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[(500,)]

In [30]:
%%sql
# What is the average order value (AOV) across all delivered orders?
select avg(total_amount) AS AVERAGE_ORDER_VALUE from orders
where order_status = 'DELIVERED'

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[(Decimal('1041.9225'),)]

In [10]:
%%sql
# Which city / location has the highest number of orders?
SELECT location_area, COUNT(*) AS order_count
FROM orders
JOIN users ON orders.user_id = users.user_id
GROUP BY location_area
ORDER BY order_count DESC
LIMIT 1;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[('East Delhi', 620)]

In [19]:
%%sql
# Which city/location generates the highest total revenue?
SELECT location_area,sum(total_amount) as Total_revenue
FROM orders
JOIN users ON orders.user_id = users.user_id
group by location_area
order by Total_revenue desc
LIMIT 1;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[('East Delhi', Decimal('656350'))]

In [39]:
%%sql
#Which are the top 5 restaurants by total revenue?		     
select round(sum(total_amount)) as total_amount, name
from orders
join restaurants on orders.restaurant_id=restaurants.restaurant_id
group by name
order by total_amount desc
limit 5;

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[(Decimal('1462256'), 'The Pizza Box'),
 (Decimal('972110'), 'Salad Days'),
 (Decimal('957990'), 'Dhaba 1986'),
 (Decimal('751770'), 'Wok & Roll'),
 (Decimal('395295'), 'Sweet Truth')]

In [58]:
%%sql
# Which restaurants have the highest number of delivered orders?
select name,count(*) as Orders_delivered
from orders 
join restaurants on orders.restaurant_id = restaurants.restaurant_id
where order_status = 'DELIVERED'
group by name
order by orders_delivered desc
limit 5;

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[('Dhaba 1986', 612),
 ('Salad Days', 601),
 ('The Pizza Box', 590),
 ('Sweet Truth', 590),
 ('Wok & Roll', 573)]

In [60]:
%%sql
# What is the average order value per restaurant?			     
select name,avg(total_amount) as average_amount
from orders 
join restaurants on orders.restaurant_id = restaurants.restaurant_id
where order_status = 'DELIVERED'
group by name
order by average_amount desc
limit 5;

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[('The Pizza Box', Decimal('2021.4271')),
 ('Salad Days', Decimal('1334.0599')),
 ('Dhaba 1986', Decimal('1309.7549')),
 ('Wok & Roll', Decimal('1050.3665')),
 ('Sweet Truth', Decimal('543.2085'))]

In [9]:
%%sql
# Most ordered menu items by total quantity (delivered orders only)
SELECT m.item_name, SUM(oi.quantity) AS total_quantity_ordered
FROM order_items oi
JOIN orders o
    ON oi.order_id = o.order_id
JOIN menu_items m
    ON oi.item_id = m.item_id
WHERE o.order_status = 'DELIVERED'
GROUP BY m.item_id, m.item_name
ORDER BY total_quantity_ordered DESC
LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[('Chicken Biryani', Decimal('1154')),
 ('Paneer Butter Masala', Decimal('1039')),
 ('Grilled Veg Salad', Decimal('869')),
 ('Dal Makhani', Decimal('825')),
 ('Exotic Fruit Bowl', Decimal('821')),
 ('Quinoa Tabbouleh', Decimal('816')),
 ('Choco Lava Cake', Decimal('797')),
 ('Butter Chicken', Decimal('789')),
 ('Jeera Rice', Decimal('762')),
 ('Hakka Noodles', Decimal('757'))]

In [27]:
%%sql
# Which menu items generate the highest revenue?
select m.item_name , round(sum(oi.item_price * oi.quantity),2) as Total_revenue_genereated
from order_items oi
join orders o on oi.order_id = o.order_id
join menu_items m on oi.item_id = m.item_id
where o.order_status ='DELIVERED'
group by m.item_name, m.item_name
order by Total_revenue_genereated desc
limit 10;

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[('Pepperoni Pizza', Decimal('395829')),
 ('Butter Chicken', Decimal('355050')),
 ('Farmhouse Pizza', Decimal('354290')),
 ('Margherita Pizza', Decimal('296457')),
 ('Chicken Biryani', Decimal('288500')),
 ('Quinoa Tabbouleh', Decimal('285600')),
 ('Grilled Veg Salad', Decimal('278080')),
 ('Dal Makhani', Decimal('264000')),
 ('Exotic Fruit Bowl', Decimal('238090')),
 ('Paneer Butter Masala', Decimal('228580'))]

In [37]:
%%sql
# Are veg or non-veg items ordered more frequently?

select case
when m.is_veg = 1 then 'veg'
else 'non_veg'
end as food_type,
sum(oi.quantity) as total_quantity_ordered
from order_items oi
join orders o on oi.order_id = o.order_id
join menu_items m on oi.item_id = m.item_id
where o.order_status ='DELIVERED'
group by food_type
order by Total_quantity_ordered desc
limit 10;

 * mysql+mysqlconnector://root:***@localhost
2 rows affected.

[('veg', Decimal('12586')), ('non_veg', Decimal('3390'))]